<?php

namespace Database\Seeders;


use Illuminate\Database\Seeder;
use App\Models\AreaAddress;

class AreaAddressSeeder extends Seeder
{
    public function run(): void
    {
        $areas = [

            // المزة
            'مزة 86',
            'مزة فيلات شرقية',
            'مزة فيلات غربية',
            'مزة جبل',
            'الشيخ سعد',
            'كيوان',

            // كفرسوسة
            'كفرسوسة',
            'تنظيم كفرسوسة',

            // المهاجرين
            'المهاجرين',
            'العفيف',
            'المصطبة',

            // الصالحية
            'الصالحية',
            'أبو رمانة',
            'الروضة',

            // ركن الدين
            'ركن الدين',
            'أسد الدين',
            'الفيحاء',

            // القنوات
            'البرامكة',
            'الفحامة',
            'باب مصلى',
            'المجتهد',

            // الميدان
            'الميدان',
            'الزاهرة القديمة',
            'الزاهرة الجديدة',
            'نهر عيشة',

            // الشاغور
            'الشاغور',
            'حي الزهور',

            // دمشق القديمة
            'باب توما',
            'باب شرقي',
            'القيمرية',
            'العمارة',

            // ساروجة
            'القصاع',
            'العدوي',
            'شارع بغداد',

            // برزة
            'برزة البلد',
            'مساكن برزة',
            'عش الورور',

            // القابون
            'القابون',

            // جوبر
            'جوبر',

            // القدم
            'القدم',
            'العسالي',

            // اليرموك
            'مخيم اليرموك',

            // دمر
            'مشروع دمر',
            'دمر البلد',

            // مناطق مطلوبة كثيراً
            'جرمانا',
            'صحنايا',
            'أشرفية صحنايا',
            'قدسيا',
            'ضاحية قدسيا',
        ];

        foreach ($areas as $area) {
            AreaAddress::firstOrCreate([
                'area_name' => $area
            ]);
        }
    }
}
